function solution(n) {
  var answer = "";

  if (n % 3 == 1) {
    let numOrder = parseInt(n / 3) + 1;
  } else if (n % 3 == 2) {
    let numOrder = parseInt(n / 3) + 1;
  } else if (n % 3 == 0) {
    let numOrder = parseInt(n / 3);
  } else return "오류";

  return answer;
}


while(n<=3){
  n /= 3;
  count ++;
}
count ==0
1,2,4
count ==1
11or 21 or 41



1,2,3       //1,2,4
4,5,6       //11,12,14
7,8,9       //21,22,24
10,11,12    //41,42,44
13,14,15    //111,112,114
16,17,18    //121,122,124
19,20,21    //141,142,144
22,23,24    //211,212,214
25,26,27    //221,222,224
28,29,30    //241,242,244
31,32,33    //411,412,414
34,35,36    //421,422,424
37,38,39    //441,442,444
40,41,42    //1111,1112,1114



포크레인


